Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathCannotBeMirroredWithoutItsCurves Property
 Divided path cannot be mirrored without its curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathCannotBeMirroredWithoutItsCurves { get; }
Public Shared ReadOnly Property DividedPathCannotBeMirroredWithoutItsCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathCannotBeMirroredWithoutItsCurves {
	FailureDefinitionId^ get ();
}
static member DividedPathCannotBeMirroredWithoutItsCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace